function today_luck(){//오늘의 운세
    var todayArr = [
        "충고와 잔소리는 한 끗 차이입니다.. 충고를 하고 싶다면 한 번으로 끝내야 합니다.",
        "마지막에 반전이 있을 수 있으니 포기하지 말고 긴장도 늦추지 않길 바랍니다.",
        "한가함보다 분주한 것이 더 의미있는 하루입니다. 오늘 하루에 감사해 보세요.",
        "말 한마디에 모든 것이 물거품 될 수 있어요. 주변 눈치를 보고 말해야 합니다!",
        "아랫사람과 소통히 원활해야 조금 더 새로운 정보를 얻을 수 있으니 명심해야 합니다.",
        "찌르는 대로 결과를 볼 수 있는 하루니까 오늘만큼은 발 빠르게 움직여보길 바랍니다.",
        "자유시간을 여유있게 가지고 싶다면 집중해서 오전내에 일을 마무리 해보세요!",
        "상대방 의견도 충분히 들어봐야 할테니 의견을 조율하는 시간을 꼭 가져보세요!",
        "누군가는 나의 노고를 알아줄 것입니다. 아무도 모른다는 슬픈 생각은 하지 말아요.",
        "고민은 빨리 털어내고 해결방법을 찾는게 우선이니 재빨리 정신차려야 합니다.",
        "상대방을 조금 더 믿어보기를 바랍니다. 신뢰를 주면 더 큰일을 해낼 수 있을지 몰라요.",
        "한 순간의 방심이큰 문제로 이어질 수 있으니 긴장을 늦추지 않는게 중요합니다.",
        "충동구매는 뒤돌아서면 후회랍니다..ㅠㅠ 불필요한 지출은 스스로 자제해야 합니다.",
        "내가 잘못한 일이 있다면 먼저 용서를 구해보세요. 용서에도 타이밍이 있습니다.",
        "지금이 가장 빠른 때일수도..?! 늦었다고 생각이 들어도 하려던 일을 멈추지 맙시다.",
        "오늘 하루는 내 손에 달려있답니다.. 노력이 있다면 결과도 달라질 수 있습니다.",
        "오늘은 내가 주인공이 될 수도 있으니까 소소하더라도 이야깃거리를 만들어보세요.",
        "주변 사람들이 내 눈치를 보고 있지는 않은가요? 최대한 감정 절제를 해야 합니다.",
        "얕은 잔머리는 오히려 불리해진답니다.. 오늘은 정직한 길을 택하는게 좋습니다.",
        "작은 문제를 지금 해결하지 않으면 덧날 수도 있습니다. 지금 바로 해결해야 합니다."
    ];

    var rand = parseInt(Math.random() * todayArr.length());
    const str_rand = todayArr[rand];

    
};

function affection_luck(){//애정운
    var affectArr = [
        "겉과 속이 다른 사람일 수 있으니 처음 만난 사람이라면 의심이 꼭 필요합니다.",
        "내가 더 좋아한다고 해서 자존심 상하지 말아요.. 그런건 아무 문제가 되지 않습니다."
        
    ]
}
function affection_luck(){//건강운
    var affectArr = [
        "",
        ""
        
    ]
}
function affection_luck(){//재물운
    var affectArr = [
        "",
        ""
        
    ]
}